namespace HW_11_19_06_2024
{
    //Завдання 1:
    //Створіть клас «Фільм», який має зберігати таку інформацію:
    // назва фільму;
    // назва кіностудії;
    // жанр;
    // тривалість;
    // рік.
    //Реалізуйте у класі методи та властивості, необхідні для
    //функціонування класу.
    //Додайте до класу деструктор.Напишіть код для тестування
    //функціональності класу.
    //Напишіть код для деструктора.
    //Завдання 2:
    //Створіть клас «Вистава», який має зберігати таку інформацію:
    // назва спектаклю;
    // назва театру;
    // жанр;
    // тривалість;
    // список акторів.
    //Реалізуйте у класі методи та властивості, необхідні для
    //функціонування класу.
    //Клас має реалізовувати інтерфейс IDisposable.Напишіть код для
    //тестування функціональності класу.
    //Напишіть код для виклику методу Dispose

    internal class Program
    {
        static void Main(string[] args)
        {
            {
                Film film = new Film("Inception", "Warner Bros.", "Sci-Fi", 148, 2010);
                Console.WriteLine(film);
            }
            {
                Performance performance = new Performance();
                performance.AddCast("Bob De Castro");
                Console.WriteLine(performance);
                performance.Dispose();
            }
        }
    }
}
